---
kind: method
id: M:Autodesk.Revit.DB.DXFExportOptions.#ctor
source: html/9b6035b6-7e43-8936-0f68-d35006e03210.htm
---
# Autodesk.Revit.DB.DXFExportOptions.#ctor Method

Constructs a new instance of DXFImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public DXFExportOptions()
```